Revit 2027 API
AdvancedWood.WoodRaySegLengthZ Property
 The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WoodRaySegLengthZ { get; }
Public Shared ReadOnly Property WoodRaySegLengthZ As String
	Get
public:
static property String^ WoodRaySegLengthZ {
	String^ get ();
}
static member WoodRaySegLengthZ : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDistance".
See Also
Reference
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace